<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"12e41dddc0e430053efa23675261d5999c81c3fe11166349c02331c925278a7f","plan_job_ref":"Job Run Terraform plan in staging #211 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/13925052338","plan_out_hash":"21ef73285b1f1433d23f7288f64d1d8c4cc010a1680feeaa94380a47ad50c042","plan_hash":"47887bb5117ccedb49d0fa8e3e6303fd54b2d2f088963766733573cadd48b710","plan_text_format":"diff","version":"1.47.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2024-12-26T21:38:47Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "continuous_monitoring-staging"
+       readiness_health_check_type = (known after apply)
!~      source_code_hash            = "Hu9U2NzZCXNgOhorHVeWfHaRqn2neMcuw2Ld6vRiV8o=" -> "Pjb01xzmL5eBMif6IyldoHAA8p7GiBl3tQAzO8D2SVU="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-03-17T12:16:51Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #211](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/13925052338)